[
  {
    "education": [],
    "experience": [
      {
        "title": "HR Administrator/Marketing Associate",
        "company": "Company Name",
        "duration": "Dec 2013 to Current",
        "responsibilities": [
          "Helps to develop policies, directs and coordinates activities such as employment, compensation, labor relations, benefits, training, and employee services.",
          "Prepares employee separation notices and related documentation",
          "Keeps records of benefits plans participation such as insurance and pension plan, personnel transactions such as hires, promotions, transfers, performance reviews, and terminations, and employee statistics for government reporting.",
          "Advises management in appropriate resolution of employee relations issues.",
          "Administers benefits programs such as life, health, dental, insurance, pension plans, vacation, sick leave, leave of absence, and employee assistance."
        ]
      },
      {
        "title": "Marketing Associate",
        "company": "Company Name",
        "duration": "Designed and created marketing collateral for sales meetings, trade shows and company executives.",
        "responsibilities": [
          "Managed the in-house advertising program consisting of print and media collateral pieces.",
          "Assisted in the complete design and launch of the company's website in 2 months.",
          "Created an official company page on Facebook to facilitate interaction with customers.",
          "Analyzed ratings and programming features of competitors to evaluate the effectiveness of marketing strategies."
        ]
      },
      {
        "title": "Advanced Medical Claims Analyst",
        "company": "Company Name",
        "duration": "Mar 2012 to Dec 2013",
        "responsibilities": [
          "Reviewed medical bills for the accuracy of the treatments, tests, and hospital stays prior to sanctioning the claims.",
          "Trained to interpret the codes (ICD-9, CPT) and terminology commonly used in medical billing to fully understand the paperwork that is submitted by healthcare providers.",
          "Required to have organizational and analytical skills as well as computer skills, knowledge of medical terminology and procedures, statistics, billing standards, data analysis and laws regarding medical billing."
        ]
      },
      {
        "title": "Assistant General Manager",
        "company": "Company Name",
        "duration": "Jun 2010 to Dec 2010",
        "responsibilities": [
          "Performed duties including but not limited to, budgeting and financial management, accounting, human resources, payroll and purchasing.",
          "Established and maintained close working relationships with all departments of the hotel to ensure maximum operation, productivity, morale and guest service.",
          "Handled daily operations and reported directly to the corporate office.",
          "Hired and trained staff on overall objectives and goals with an emphasis on high customer service.",
          "Marketing and Advertising, working on public relations with the media, government and local businesses and Chamber of Commerce."
        ]
      },
      {
        "title": "Executive Support / Marketing Assistant",
        "company": "Company Name",
        "duration": "Jul 2007 to Jun 2010",
        "responsibilities": [
          "Provided assistance to various department heads - Executive, Marketing, Customer Service, Human Resources.",
          "Managed front-end operations to ensure friendly and efficient transactions.",
          "Ensured the swift resolution of customer issues to preserve customer loyalty while complying with company policies.",
          "Exemplified the second-to-none customer service delivery in all interactions with customers and potent"
        ]
      }
    ],
    "skills": [],
    "awards": [],
    "original_category": "HR"
  },
  {
    "education": [],
    "experience": [
      {
        "title": "HR Specialist, US HR Operations",
        "company": "Company Name",
        "duration": "09/2015 to Current",
        "responsibilities": [
          "Managed communication regarding launch of Operations group, policy changes and system outages",
          "Designed standard work and job aids to create comprehensive training program for new employees and contractors",
          "Audited job postings for old, pending, on-hold and draft positions",
          "Audited union hourly, non-union hourly and salary background checks and drug screens",
          "Conducted monthly new hire benefits briefing to new employees across all business units",
          "Served as a link between HR Managers and vendors by handling questions and resolving system-related issues",
          "Provide real-time process improvement feedback on key metrics and initiatives",
          "Successfully re-branded US HR Operations SharePoint site",
          "Business Unit project manager for RFI/RFP on Background Check and Drug Screen vendor"
        ]
      },
      {
        "title": "IT, Marketing and Communications Co-op",
        "company": "Company Name",
        "duration": "01/2014 to 05/2015",
        "responsibilities": [
          "Posted new articles, changes and updates to corporate SharePoint site including graphics and visual communications",
          "Researched and drafted articles and feature stories to promote company activities and programs",
          "Co-edited and developed content for quarterly published newsletter",
          "Provided communication support for internal and external events",
          "Collaborated with Communication team, media professionals and vendors to determine program needs for print materials, web design and digital communications",
          "Entrusted to lead product, service and software launches for Digital Asset Management tool, Marketing Toolkit website and Executive Tradeshows Calendar",
          "Created presentations for management and executive approval to ensure alignment with corporate guidelines and branding",
          "Maintained the MySikorsky SharePoint site and provided timely solutions to mitigate issues",
          "Created story board and produced video for annual IT All Hands meeting"
        ]
      },
      {
        "title": "Relationship Coordinator/Marketing Specialist",
        "company": "Company Name",
        "duration": "10/2012 to 01/2014",
        "responsibilities": [
          "Partnered with vendor to manage the in-house advertising program consisting of print and media collateral pieces",
          "Coordinated pre-show and post-show activities at trade shows",
          "Managed marketing campaigns to generate new business and to support partner and sales teams",
          "Ordered marketing collateral for meetings, trade shows and advisors",
          "Improved, administered and modified marketing programs to increase product awareness",
          "Assisted in preparing internal promotional publications, managed marketing material inventory and supervised distribution of publications to ensure high quality product output",
          "Coordinated marketing materials including brochures, promotional materials and products",
          "Partnered with graphic designers to develop appropriate materials and branding for brochures",
          "Used tracking and reporting systems for sales leads and appointments"
        ]
      },
      {
        "title": "Assistant Head Teller",
        "company": "Company Name",
        "duration": "09/2009 to 10/2012",
        "responsibilities": [
          "Received an internal audit score of 100 %",
          "Performed daily and monthly audits of ATM machines and tellers",
          "Educated customers on a variety of retail products and available credit options",
          "Consistently met or exceeded quarterly sales goals",
          "Promoted products and services to customers while maintaining company brand identity",
          "Implemented programs to achieve and exceed customer and company participation goals",
          "Organized company sponsored events on campus resulting in increased brand awareness",
          "Coached peers on the proper use of programs to improve work flow efficiency",
          "Utilized product knowledge to successfully sell to and refer clients based on individual needs",
          "Promoted marketing the grand opening of new branch locations to strengthen company brand affinity",
          "Organized company sponsored events resulting in increased brand awareness and improved sales",
          "Coached peers on the proper use of programs to increase work flow efficiency"
        ]
      }
    ],
    "skills": [],
    "awards": [],
    "original_category": "HR"
  },
  {
    "education": [],
    "experience": [
      {
        "title": "HR Director",
        "company": "Company Name",
        "duration": "09/2016 to Current",
        "responsibilities": [
          "Developed New Website for Agency, payroll processing changes, and implementation of new HRIS System.",
          "Oversaw the employment process taking the lead role in clinician, physician and management team recruitment initiatives.",
          "Developed, maintain and interpret HR policy.",
          "Authored the Employee Handbook.",
          "Provided coaching and support to management and supervisors on performance management and other related issues.",
          "Maintained in-depth knowledge of legal requirements related to day-to-day management of employees, reducing legal risks and ensuring regulatory compliance.",
          "Evaluated and recommend changes to the employee benefits plan.",
          "Oversaw day to day administration of benefits."
        ]
      },
      {
        "title": "HR Director",
        "company": "Company Name",
        "duration": "04/2009 to 09/2016",
        "responsibilities": [
          "Develped Supervisory Education, SHRO Website, SHRO HRIS System and Automation of payroll processing.",
          "Established and directed a comprehensive statewide human resource program for both classified and unclassified State employees/positions in the Adjutant General's Department.",
          "Resolved non-routine HR related issues associated as they arose; reviewed documents and approved all hires and promotions; reviews and"
        ]
      }
    ],
    "skills": [
      "Recruiting",
      "FMLA/EEO/FLSA",
      "HRIS Development",
      "Benefit Administration",
      "Policy Development",
      "Web Page Development"
    ],
    "awards": [
      "Kansas Health Institute - Health Outcomes for the State of Kansas - 1999",
      "Project Management Institute Member",
      "SHRM",
      "Chamber of Commerce - 1999",
      "Friends University President's Honor Roll - 1997",
      "Friends University Dean's Honor Roll",
      "Student Liaison for Friends University Topeka",
      "ASHHRA",
      "KAHHR",
      "ACM"
    ],
    "original_category": "HR"
  },
  {
    "education": [
      {
        "degree": "Certificate of Completion",
        "field": "Business Administration",
        "school": "Texas A&M Extension Services",
        "graduation_date": "1997"
      }
    ],
    "experience": [
      {
        "title": "Hr Specialist",
        "company": "Company Name",
        "duration": "May 2007 to Oct 2008",
        "responsibilities": [
          "Received inbound emails from clients as initial point of contact to answer questions related to HR policies, practices or to resolve issues.",
          "Helped the client by answering their inquiry, resolving their issue or routing their email to a caseworker for resolution.",
          "Recorded and tracked the client issue via the case management tool from initiation to resolution.",
          "Maintained records of customer interactions and transactions by documenting details of inquiries, complaints, and comments as well as actions taken."
        ]
      },
      {
        "title": "Customer Service Representative",
        "company": "Company Name",
        "duration": "Mar 2007 to Feb 2008",
        "responsibilities": [
          "Maintained records of customer interactions and transactions by documenting details of inquiries, complaints, and comments, as well as actions taken.",
          "Developed and implemented filing and delivery methods for FMLA and Short Term Disability documentation to respective global clientele.",
          "Facilitated communication for the Absence Management Team to clients and internal departmental teams.",
          "Organized and maintained payroll and people services database management system.",
          "Communicated to clients and internal/external departmental teams mitigated risks and resolutions regarding policy, transactions and other queries"
        ]
      },
      {
        "title": "Call Centre Shift Supervisor",
        "company": "Company Name",
        "duration": "Aug 2003 to Mar 2007",
        "responsibilities": [
          "Answered and Dispatched calls for Medical and Professional clients in the San Antonio and surrounding areas.",
          "Provided call monitoring to ensure staff was adhering to quality call control.",
          "Maintained On Call books for various medical staff to ensure that the correct staff was contacted during after hours and weekends."
        ]
      }
    ],
    "skills": [
      "10-Key by touch",
      "Type 50 wpm",
      "filing",
      "Access",
      "Microsoft Excel",
      "Microsoft Outlook",
      "Microsoft PowerPoint",
      "Microsoft Word"
    ],
    "awards": [],
    "original_category": "HR"
  },
  {
    "education": [],
    "experience": [
      {
        "title": "HR Manager",
        "company": "Company Name",
        "duration": "Jan 2015 to Current",
        "responsibilities": [
          "Manage the Human Resource function for e-Cycle's corporate office as well as their fulfillment and data center",
          "Foster an associate-oriented culture emphasizing continuous improvement, teamwork, high performance, and quality",
          "Ensure organizational conformation with applicable HR related regulations and statutes as well as organizational procedures and policies",
          "Implement HR programs and policies as needed by the organization",
          "Identify, evaluate, and resolve human relations, employee morale, work performance, and organizational productivity concerns",
          "Develop staffing strategies and implement programs and plans to identify and cultivate effective and appropriate sources for employees at all job levels",
          "Create or assist in the creation of associate training and organizational development programs",
          "Develop and manage the annual associate review process",
          "Insure that regional staff is included in corporate activities and feel like they are a part of the team",
          "Responsible for the human resource management system(s) and provide staff and management with essential reporting information in order to help them in managing their associate resources",
          "Recruit and retain top quality associates for each department, this includes recruiting nationally and in some cases at an executive level",
          "Create or assist in the creation of compensation plans",
          "Employee benefit administration consisting of Health, Dental, Vision, VSTD, VLTD and 401(k)",
          "Successful in reducing the health benefit expected increase from 46% to 5% during my first month with the organization"
        ]
      },
      {
        "title": "Sr. HR Manager",
        "company": "Company Name",
        "duration": "Jan 2013 to Jan 2015",
        "responsibilities": [
          "Partnered with local leadership and Corporate HR to develop and implement HR policies, processes, technology and services aligned to support company's strategic initiatives",
          "Coordinated efforts to recruit and hire over 220 full-time hourly associates and 27 management level employees while converting agency staff to full time",
          "Managed and created the set up of the HR business office, including development of personnel files, new hire practices, payroll, and HR reporting",
          "Managed, by providing direction and development to HR, and developed the HR delivery as business continued to grow",
          "Strategic business partner to the Site Director and other operations leaders in support of start-up operations, day-to-day operations, and peak season planning, staffing, and operations",
          "Worked successfully with local temporary agencies to staff to peak volume, which consisted of over 1800 total associates delivering over 3 million units from Black Friday to Christmas",
          "Influenced HR strategy and executed tactical direction for the facility within the overall HR strategy",
          "Ensured internal consistency of HR policies and procedures across multiple locations",
          "Interacted with the Corporate HR team for exempt staffing, compensation and benefits, and other functional groups to support Operations",
          "Maintained knowledge of HR policies and procedures, laws and regulations, industry trends"
        ]
      }
    ],
    "skills": [
      "HR Department Startup",
      "Employment Law",
      "FMLA/ADA/EEO/WC",
      "Mediation & Advocacy",
      "HR Policies & Procedures",
      "Staff Recruitment & Retention",
      "Salary Negotiations",
      "Employee Relations",
      "Benefits Administration",
      "Unemployment Administration",
      "Worker's Compensation Administration",
      "Orientation & On-Boarding",
      "HRIS Technologies",
      "Training & Development",
      "Performance Management",
      "Organizational Development",
      "HR Program/Project Management",
      "HRIS applications (Lawson, Paychex, Kronos, ADP)",
      "MS Office (Word, Excel, PowerPoint, Publisher, Access, Visio, Outlook)"
    ],
    "awards": [],
    "original_category": "HR"
  }
]